app/Controllers/Products.php

    public function index()
    {
        $model = new ModelProducts();
    	$kunci = $this->request->getVar('katakunci');

        if ($kunci) {
            $query = $model->pencarian($kunci);
            $text = 'Pencarian dengan kata kunci "'.$kunci.'"';
        } else {
            $query = $model;
            $text = '';
        }

        $data['products'] = $query->paginate();
---
SELECT *
FROM `products`
WHERE `model` LIKE '%ryzen%' ESCAPE '!'
 LIMIT 20
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `model` LIKE '%ryzen%' ESCAPE '!'

    public function detail($id)
    {
        $model = new ModelProducts();
        $data['products'] = $model->find($id);
---
SELECT *
FROM `products`
WHERE `products`.`id` = '1'