app/Models/ModelDrivers.php

    public function tampil()
    {
        // return $this->table('drivers')->findAll();
        return $this->findAll();
---
SELECT *
FROM `drivers`